{
    "jkt": {
        "name": "ЖКТ",
        "questions": [
            {
                "id": 1,
                "text": "Избыточная потливость беспокоит вас?",
                "response": "Это может указывать на окислительный стресс и перегрузку систем детоксикации. Печень, почки и кишечник могут быть не в состоянии эффективно выводить токсины. Рекомендуется сдать анализы на биохимию крови для оценки функции печени и почек. Консультация с нутрициологом поможет улучшить ваше питание и поддержать работу органов детоксикации."
            },
            {
                "id": 2,
                "text": "В уголках рта часто появляются трещины (заеды)?",
                "response": "Это может свидетельствовать о дисбиозе кишечника и дефиците витамина B2. Рекомендуется консультация врача и сдача анализов на уровень витаминов и микроэлементов. Консультация с нутрициологом также поможет сбалансировать ваш рацион."
            },
            {
                "id": 3,
                "text": "Страдаете от частых головных болей?",
                "response": "Головные боли могут быть признаком проблем с детоксикацией или углеводным обменом. Также это может быть связано с накоплением аммиака или ацетона. Необходимо сдать анализы крови на метаболиты и проконсультироваться с нутрициологом. Консультация с нутрициологом поможет оценить ваш рацион и внести необходимые изменения."
            },
            {
                "id": 4,
                "text": "Изменения в стуле, такие как диарея или запор, стали частыми?",
                "response": "Это может быть связано с нарушением работы желчного пузыря или непереносимостью определенных продуктов. Рекомендуется провести анализ на выявление непереносимости продуктов и обратиться к гастроэнтерологу. Консультация с нутрициологом поможет оптимизировать ваше питание."
            },
            {
                "id": 5,
                "text": "Мучает метеоризм?",
                "response": "Метеоризм может быть следствием пищевой непереносимости или синдрома избыточного бактериального и грибкового роста в кишечнике. Необходимо провести тест на непереносимость пищи и дисбактериоз. Консультация с нутрициологом поможет выявить причины и предложит рацион для улучшения состояния."
            },
            {
                "id": 6,
                "text": "Часто испытываете отрыжку или изжогу?",
                "response": "Эти симптомы могут быть связаны с пониженной кислотностью в желудке или гастроэзофагеальным рефлюксом. Рекомендуется консультация с гастроэнтерологом и, при необходимости, гастроскопия. Консультация с нутрициологом поможет выявить конкретные триггеры в питании."
            },
            {
                "id": 7,
                "text": "Боли в животе от спазмов и газов беспокоят вас?",
                "response": "Это может указывать на проблемы с желчным пузырем или наличие бактериального/грибкового роста в кишечнике. Также не исключен паразитоз. Рекомендуется сдать соответствующие анализы и сделать УЗИ органов брюшной полости. Консультация с нутрициологом поможет скорректировать питание."
            },
            {
                "id": 8,
                "text": "Есть белый налет на языке?",
                "response": "Это часто указывает на кандидоз и проблемы с кислотностью желудка. Необходимо провести анализы на наличие грибковых инфекций и проконсультироваться с нутрициологом. Консультация с нутрициологом поможет скорректировать ваш питание для восстановления здоровья."
            },
            {
                "id": 9,
                "text": "Обратите внимание на цвет склер глаз — они желтоватые?",
                "response": "Это может указывать на синдром Жильбера или проблемы с желчным пузырем. Рекомендуется проведение биохимического анализа крови и консультация с нутрициологом для исключения серьезных заболеваний."
            },
            {
                "id": 10,
                "text": "Кал не тонет и пачкает унитаз?",
                "response": "Это может быть признаком ферментативной недостаточности или проблем с оттоком желчи. Рекомендуется сдать анализ кала на содержание жиров и ферментов, а также проконсультироваться с гастроэнтерологом."
            },
            {
                "id": 11,
                "text": "Пятки слишком сухие и появляются натоптыши?",
                "response": "Это может свидетельствовать о проблемах с желчным пузырем и дефиците жирорастворимых витаминов. Рекомендуется сдать анализы на витамины и желчные кислоты и обсудить результаты с нутрициологом. Консультация с нутрициологом поможет корректировать питание."
            },
            {
                "id": 12,
                "text": "Мало овощей в рационе?",
                "response": "Это может способствовать развитию дисбиоза кишечника. Для диагностики рекомендуется провести анализы на микрофлору ЖКТ. Консультация с нутрициологом поможет вносить изменения в ваш рацион для поддержания баланса микробиома."
            },
            {
                "id": 13,
                "text": "Часто пьете жидкости сразу после еды?",
                "response": "Это может негативно сказаться на пищеварении. Обсудите с гастроэнтерологом рекомендации по питанию. Консультация с нутрициологом поможет адаптировать привычки для оптимального здоровья ЖКТ."
            },
            {
                "id": 14,
                "text": "Часто выбираете сладкие продукты?",
                "response": "Злоупотребление сладким может привести к инсулинорезистентности и дисбиозу. Рекомендуется сдача анализа на уровень глюкозы и инсулина в крови, и консультация с эндокринологом. Консультация с нутрициологом поможет сбалансировать питание для снижения этих рисков."
            },
            {
                "id": 15,
                "text": "Едите более 4 раз в день?",
                "response": "Чрезмерное дробное питание может вызывать гормональные дисбалансы и нарушения углеводного обмена. Рекомендуется обсудить с эндокринологом и гастроэнтерологом подходящий для вас режим питания. Консультация с нутрициологом также поможет откорректировать питание для достижения оптимального здоровья."
            }
        ]
    },
    "hormones": {
        "name": "Щитовидная железа",
        "questions": [
            {
                "id": 1,
                "text": "У вас наблюдается усталость и вялость, даже при достаточном отдыхе?",
                "response": "Это может быть признаком гипотиреоза, когда щитовидная железа вырабатывает недостаточное количество гормонов. Это состояние может привести к снижению обмена веществ, что вызывает постоянную усталость. Рекомендуется сдать анализы на уровень ТТГ (тиреотропного гормона) и свободного Т4 (тироксина), а также проконсультироваться с эндокринологом для обсуждения возможного лечения, которое может включать в себя гормональную терапию."
            },
            {
                "id": 2,
                "text": "Замечаете ли частые изменения настроения или депрессию?",
                "response": "Дисбаланс гормонов щитовидной железы может влиять на психическое состояние, вызывая депрессию или перепады настроения из-за изменения химии мозга. Актуально будет пройти анализы на уровень щитовидных гормонов, и, в зависимости от результатов, врач может назначить заместительную терапию или другие медицинские вмешательства. Поддержка психолога также может быть полезной."
            },
            {
                "id": 3,
                "text": "Вы потеряли или набрали вес без видимых причин?",
                "response": "Необъяснимая потеря или набор веса могут быть связаны с гипертиреозом или гипотиреозом, соответственно. Эти состояния влияют на скорость метаболизма. Могут быть назначены тесты на ТТГ, Т3 и Т4, и, в зависимости от диагноза, может потребоваться коррекция диеты и режима физической активности, а также медикаментозное лечение."
            },
            {
                "id": 4,
                "text": "У вас сухая кожа и ломкие волосы?",
                "response": "Недостаток гормонов щитовидной железы может привести к замедленному метаболизму, что, в свою очередь, вызывает сухость кожи и ломкость волос. Проверка уровня щитовидных гормонов в крови поможет подтвердить диагноз, и эндокринолог может порекомендовать увлажняющие средства и витамины (например, биотин и витамин Е), помимо основной терапии."
            },
            {
                "id": 5,
                "text": "Чувствуете ли вы холод даже в теплых условиях?",
                "response": "Чувствительность к холоду может быть связана с гипотиреозом, так как сниженный уровень гормонов замедляет метаболизм, влияя на терморегуляцию. Анализ уровня тиреоидных гормонов поможет определить наличие проблемы и подобрать гормонозаместительную терапию."
            },
            {
                "id": 6,
                "text": "У вас есть проблемы с концентрацией внимания или памятью?",
                "response": "Гормональный дисбаланс может влиять на когнитивные функции, снижая концентрацию и ухудшая память. Рекомендуется анализ на щитовидные гормоны и консультация с нутрициологом, который может порекомендовать когнитивные тренировки и коррекцию дефицита гормонов."
            },
            {
                "id": 7,
                "text": "Замечаете отечность лица или век по утрам?",
                "response": "Отечность может быть признаком гипотиреоза из-за задержки жидкости в тканях. Проверка уровня ТТГ и Т4 поможет установить правильный диагноз, и лечение может включать в себя прием мочегонных препаратов или гормонозаместительной терапии."
            },
            {
                "id": 8,
                "text": "Страдаете от бессонницы или нарушенного сна?",
                "response": "Избыток или недостаток гормонов может влиять на сон, вызывая либо бессонницу, либо чрезмерную сонливость. Исследование уровня гормонов щитовидной железы в сочетании с соблюдением режима сна и применением техник релаксации может помочь в решении проблемы."
            },
            {
                "id": 9,
                "text": "Есть ли у вас проблемы с пищеварением, такие как запор или диарея?",
                "response": "Эти проблемы могут указывать на гипо- или гипертиреоз. Гипотиреоз склонен вызывать запоры, тогда как гипертиреоз может быть причиной ускоренного пищеварения и диареи. Анализы на ТТГ, Т4 и Т3 помогут уточнить диагноз и определить необходимое лечение, возможно, с применением пробиотиков и коррекции питания."
            },
            {
                "id": 10,
                "text": "Чувствуете ли вы, что у вас изменился голос или появились трудности с глотанием?",
                "response": "Это может указывать на увеличение щитовидной железы или наличие узлов, влияющих на голосовые связки. Рекомендуется проведение УЗИ и консультация с эндокринологом, которые помогут установить причины и предложить методы вмешательства, которые могут варьироваться от наблюдения до хирургического вмешательства."
            },
            {
                "id": 11,
                "text": "Замечаете ли вы дрожь в руках или повышенное потоотделение?",
                "response": "Эти симптомы могут быть связаны с гипертиреозом, так как гормоны в избытке возбуждают нервную систему. Необходимо сдать кровь на гормоны и обратиться к эндокринологу, который может назначить препараты для снижения активности щитовидной железы."
            },
            {
                "id": 12,
                "text": "У вас снизилось либидо?",
                "response": "Гормональный дисбаланс, включая нарушения работы щитовидной железы, может влиять на половое влечение. Проверка уровня гормонов щитовидной железы и половых гормонов будет необходима для диагностики. Лечение может включать в себя гормонозаместительную терапию и консультации с сексологом или психологом."
            },
            {
                "id": 13,
                "text": "Появились ли у вас новые или увеличились ранее существующие узлы на шее?",
                "response": "Это может указывать на изменения в щитовидной железе, такие как зоб или образование узлов. Рекомендуется консультация с эндокринологом и проведение УЗИ для оценки состояния щитовидной железы; возможно, потребуется провести биопсию для исключения злокачественных изменений и принять решение о дальнейшем лечении."
            }
        ]
    },
    "insulin": {
        "name": "Инсулин",
        "questions": [
            {
                "id": 1,
                "text": "Кожа на сгибах локтей и в промежностях имеет более темный оттенок?",
                "response": "Это состояние известно как акантоз и является точным признаком нарушения углеводного обмена, такого как инсулинорезистентность и метаболический синдром. Рекомендуется консультация эндокринолога и сдача анализа на уровень инсулина и глюкозы в крови."
            },
            {
                "id": 2,
                "text": "У вас рано появились морщины, хотя вы всегда ухаживали за кожей?",
                "response": "Это может указывать на процессы гликации в организме и дефицит коллагена. Гликация способствует старению кожи и может быть связана с нарушением обмена веществ. Сдача анализов на гликозилированный гемоглобин и консультация с нутрициологом помогут понять ситуацию."
            },
            {
                "id": 3,
                "text": "Диагностирован сахарный диабет II типа и есть лишний вес?",
                "response": "Это прямое следствие нарушения углеводного обмена. Рекомендуется регулярный мониторинг уровня глюкозы в крови и поддержка специалиста по диетологии для оптимизации питания."
            },
            {
                "id": 4,
                "text": "Заметили за собой снижение когнитивных функций?",
                "response": "Это может быть симптомом множества проблем, включая инсулинорезистентность, дисфункцию щитовидной железы и некоторых дефицитов. Рекомендуется анализ на гормоны щитовидной железы и инсулин, а также консультация с нутрициологом для выявления причин."
            },
            {
                "id": 5,
                "text": "Испытываете неудержимую тягу к сладкому?",
                "response": "Это может быть свидетельством нарушенного углеводного обмена и сигналом о развитии инсулинорезистентности. Регулярное мониторирование уровня сахара в крови и консультация с эндокринологом помогут контролировать ситуацию."
            },
            {
                "id": 6,
                "text": "Чувствуете постоянную усталость и сонливость после еды?",
                "response": "Это может быть связано с резкими колебаниями уровня глюкозы в крови, характерными для инсулинорезистентности. Рекомендуется сдать тест толерантности к глюкозе и обратиться за консультацией к эндокринологу."
            },
            {
                "id": 7,
                "text": "Наблюдается увеличение в массе тела, несмотря на нормальный рацион?",
                "response": "Набор веса без изменений в питании может указывать на инсулинорезистентность. Анализы на уровень инсулина, лептина и глюкозы помогут прояснить ситуацию."
            },
            {
                "id": 8,
                "text": "Шелушится и трескается кожа на руках и ногах?",
                "response": "Это может быть связано с нарушениями метаболизма и инсулинорезистентностью. Рекомендуется анализ на уровень витаминов и минералов и консультация с дерматологом или эндокринологом."
            },
            {
                "id": 9,
                "text": "Сталкивались с частыми инфицирования кожи или грибковыми заболеваниями?",
                "response": "Инфекционные заболевания могут свидетельствовать о повышенном уровне сахара в крови, что возможно при инсулинорезистентности. Анализ на гликемический профиль и консультация с дерматологом помогут с решением проблемы."
            },
            {
                "id": 10,
                "text": "У вас повышенное кровяное давление?",
                "response": "Инсулинорезистентность может влиять на артериальное давление. Рекомендуется мониторинг уровня инсулина и сахара, и консультация с кардиологом."
            },
            {
                "id": 11,
                "text": "Заметили увеличение в объеме талии при неизменной массе тела?",
                "response": "Увеличение объема талии может быть ранним признаком метаболического синдрома и инсулинорезистентности. Рекомендуется сдача анализов на липидный профиль и консультация с диетологом."
            },
            {
                "id": 12,
                "text": "Вы часто испытываете перепады настроения и раздражительность?",
                "response": "Такие симптомы могут быть связаны с колебаниями уровня сахара в крови. Рекомендуется мониторинг уровня глюкозы и консультация с психологом или эндокринологом."
            },
            {
                "id": 13,
                "text": "Легко появляются синяки и долго заживают раны?",
                "response": "Это может быть связано с нарушениями метаболизма, включая инсулинорезистентность. Рекомендуется сдача анализа на коагулограмму и консультация с нутрициологом для выявления причин."
            }
        ]
    },
    "deficiencies":{
        "name": "Дефициты",
        "questions": [
            {
                "id": 1,
                "text": "На ваших ногтях есть лунки?",
                "response": "Возможно, присутствует риск гипоксии. Советую сдать кровь для проверки уровня гемоглобина, так как его понижение может быть одной из причин отсутствия лунок на ногтях."
            },
            {
                "id": 2,
                "text": "На ногтях - белые точки?",
                "response": "Это может быть признаком дефицита цинка, минерала, отвечающего за правильное пищеварение, заживление ран и поддержку иммунитета. Цинк также участвует в регулировании гормональной активности. Рассмотрите возможность увеличения его потребления через пищу или добавки после консультации со специалистом."
            },
            {
                "id": 3,
                "text": "В уголках рта часто образуются трещины (“заеды”)?",
                "response": "Это может указывать на дефицит витамина B2 и дисбиоз кишечника. Витамин B2 необходим для метаболизма, функционирования нервной системы и поддержания здоровья кожи и слизистых оболочек. Рекомендуется обсудить результаты со специалистом и рассмотреть корректировку диеты."
            },
            {
                "id": 4,
                "text": "Если “сыпятся” волосы?",
                "response": "Обильное выпадение волос может свидетельствовать о проблемах с гормонами щитовидной железы или дефиците белка и цинка. Убедитесь, что ваше питание сбалансировано, и проконсультируйтесь со специалистом для детальной диагностики."
            },
            {
                "id": 5,
                "text": "Беспокоит кровоточивость десен?",
                "response": "Это яркий признак дефицита витамина C, который важен для поддержания иммунной системы и улучшения абсорбции железа. Добавьте в рацион больше цитрусовых и других источников витамина C или обсудите со специалистом возможность приема добавок."
            },
            {
                "id": 6,
                "text": "У вас рано появилась седина?",
                "response": "Это может быть связано с окислительным стрессом и дефицитом меди. Медь играет роль в формировании красных кровяных клеток и поддерживает здоровье нервной системы, костей и суставов. Рекомендуется пройти тестирование и, при необходимости, скорректировать рацион."
            },
            {
                "id": 7,
                "text": "Часто отмечаете у себя судороги, тики, мышечную слабость?",
                "response": "Симптомы могут указывать на дефицит магния, который необходим для здоровья мышц, функционирования нервной системы и сердца. Рассмотрите увеличение потребления продуктов, богатых магнием, и обсудите симптомы с нутрициологом."
            },
            {
                "id": 8,
                "text": "Ваш язык напоминает географическую карту?",
                "response": "Неоднородная поверхность языка может свидетельствовать о дефиците витаминов группы B, важных для метаболизма и функционирования нервной системы. Обсудите с нутрициологом возможность тестирования и введите в рацион больше источников этих витаминов."
            },
            {
                "id": 9,
                "text": "Часто и легко подхватываете простуды?",
                "response": "Это может быть следствием сниженного иммунитета и дефицита нескольких витаминов. Важно поддерживать сбалансированную диету и, при необходимости, обсудить с нутрициологом прием добавок для укрепления иммунной системы."
            },
            {
                "id": 10,
                "text": "Вы значительно хуже видите в сумерках?",
                "response": "Проблемы с видением в сумерках могут указывать на застой желчи и дефицит жирорастворимых витаминов, таких как A и E. Обсудите со специалистом правильные шаги для решения этих проблем."
            },
            {
                "id": 11,
                "text": "Ломкие, сухие, непослушные, секущиеся волосы и ломкие ногти?",
                "response": "Это может говорить о дефиците белка и серы. Сера важна для образования белков и аминокислот и участвует в детоксикации. Обратите внимание на корректировку питания и, при необходимости, прием добавок."
            },
            {
                "id": 12,
                "text": "Постоянно испытываете слабость?",
                "response": "Это может быть признаком анемии и нарушений работы щитовидной железы. Обсудите с нутрициологом тестирование уровня железа и гормонов щитовидной железы для постановки правильного диагноза."
            },
            {
                "id": 13,
                "text": "Испытываете сонливость в любое время суток?",
                "response": "Сонливость может быть симптомом анемии или проблем с щитовидной железой и надпочечниками, а также указывать на дефициты. Проконсультируйтесь с нутрициологом для получения детального анализа и диагностики."
            },
            {
                "id": 14,
                "text": "Вы исключили из рациона животные продукты?",
                "response": "Это может привести к дефициту половых гормонов, белка и витаминов, особенно B12 и D. Рассмотрите возможность введения растительных или дополнительных источников необходимых элементов. Обсудите с диетологом способы корректировки питания."
            }
        ]
    }
}